lmhuu02/Self-Driving-STM32-Car-public/Cac_bai_lab_hoan_chinh/CODE_STM32F0/PHIM BAM/main.c
#include <stm32f0xx.h>                    // thu vien cho dong stm32f0xx
#include <stm32f0xx_rcc.h>            // thu vien cau hinh xung clock
#include <stm32f0xx_gpio.h>            // thu vien cau hinh gpio
// hàm delay
int dem;
void delay(void)
    {
        int time;
        for(time=0;time<4000000;time++);// tre khoang 4000000 lenh
    }
void gpio_setup(void)
    {
    // khai bao GPIO_InitStructure = GPIO_InitTypeDef
    // 2 cach viet la nhu nhau
    GPIO_InitTypeDef        GPIO_InitStructure;
        /* cap xung cho PC */
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);

  /* cau hinh PC9 and PC8 la dau ra, khong dung tro keo */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_2 | GPIO_Pin_1 | GPIO_Pin_0;// dung PC9,PC8,PC7,PC1,PC0
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;// che do uotput
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// reset pin khi uotput
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;// clock 50Mhz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;// khong dung tro keo
  GPIO_Init(GPIOC, &GPIO_InitStructure);// khoi tao PC

    // cau hinh cho PA0
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

  /* cau hinh PA0 dau vao,tro keo PuPd_DOWN */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;// dung PA0
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;// che do uotput
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// reset pin khi uotput
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;// clock 50Mhz
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;// khong dung tro keo
  GPIO_Init(GPIOA, &GPIO_InitStructure);// khoi tao PA
    }
int main(void)
{
    gpio_setup();
    GPIOC->ODR=0x0000; //PC8=0; Pc9=0  “GPIOC->ODR tương đương với thanh ghi GPIOC_ODR .nó là thanh ghi uotput GPIO->ODR, vị trí bit tương ứng với vị trí chân trên chip.ví dụ muốn cho PC8=1 PC9 =0 : GPIOC->ODR=0x0100;”
while(1)
    {
    if((GPIOA->IDR&0x01)==1) // nếu PA0=1
        {
        while((GPIOA->IDR&0x01)==1);// khi chưa nhả phím, không làm gì cả
dem++;
if(dem==1) GPIOC->ODR=0x0001;//PC0=1
if(dem==2) GPIOC->ODR=0x0002;//PC1=1
if(dem==3) GPIOC->ODR=0x0004;//PC2=1
if(dem==4) GPIOC->ODR=0x0008;//PC3=1
if(dem==5) GPIOC->ODR=0x0004;//PC2=1
if(dem==6) GPIOC->ODR=0x0002;//PC1=1
if(dem==7) GPIOC->ODR=0x0001;//PC0=1
        }
    }
}


